


 //图片的左 minLon，右 maxLon，上 maxLat， 下 minLat的坐标
 const publicOptions = {
    // 2 莘县水源新能源科技有限公司
    '2': {
       name: 'shenxianshuiyuan',
       coord:{
           maxLon: '115.59950441',
           minLon: '115.59464827',
           maxLat: '36.04113762',
           minLat: '36.03838588',
       }
    },
     // 聊城德丰化工有限公司
     '3': {
        name: 'lcdfhuagong',
        coord:{
            maxLon: '115.37133694',
            minLon: '115.36725059',
            maxLat: '35.81893869',
            minLat: '35.81564035',
        }
    },
    //源源化工
    '4': {
        name: 'yyhg',
        coord:{
            maxLon: '115.35990000',
            minLon: '115.35625756',
            maxLat: '35.82548168',
            minLat: '35.82252343',
        }
    },
    // 东染
    '6': {
        name: 'dongran',
        coord:{
            maxLon: '115.36061816',
            minLon: '115.35576403',
            maxLat: '35.83953744',
            minLat: '35.83559523',
        }
        // coord:{
        //     maxLon: '115.3597229719161987',
        //     minLon: '115.3565633296966553',
        //     maxLat: '35.8392727112318781',
        //     minLat: '35.8356805760555233',
        // }
    },
    // 国力
    '7': {
        name: 'guoli',
        coord:{
            maxLon: '118.57665181',
            minLon: '118.57391059',
            maxLat: '35.72705487',
            minLat: '35.72490135',
        }
    },
    // 瑞丰高分子
    '11': {
        name: 'ruifenggaofenzi',
        coord:{
            maxLon: '118.57123978',
            minLon: '118.56731303',
            maxLat: '35.70819602',
            minLat: '35.70464751',
        }
    },
    // 山东沂联石化科技有限公司
    '19': {
        name: 'yilianshihua',
        coord:{
            maxLon: '118.5731704205',
            minLon: '118.5702717864',
            maxLat: '35.710435507',
            minLat: '35.7082101381',
        }
    },
    // 山东同创精细化工有限公司
    '20': {
        name: 'tongchuanjingxi',
        coord:{
            maxLon: '118.5611057281494141',
            minLon: '118.5600328445434570',
            maxLat: '35.7043039225475809',
            minLat: '35.7030232128761398',
        }
    },
    // 临沂广辰化工有限公司
    '21': {
        name: 'guangchenhuagong',
        coord:{
            maxLon: '118.56275529',
            minLon: '118.56116742',
            maxLat: '35.70430828',
            minLat: '35.70302382',
        }
    },
    // 沂水东信日用化工有限公司
    '23': {
        name: 'dongxinrihua',
        coord:{
            maxLon: '118.5633816363',
            minLon: '118.5622273235',
            maxLat: '35.7157242617',
            minLat: '35.7147138830',
        }
    },
    // 山东邦能日化有限公司
    '24': {
        name: 'bangnengrihua',
        coord:{
            maxLon: '118.5664808750152588',
            minLon: '118.5644584894180298',
            maxLat: '35.7190698027898890',
            minLat: '35.7159818257607711',
        }
    },
    // 山东中胜涂料有限公司
    '26': {
        name: 'zhongshengtuliao',
        coord:{
            maxLon: '116.436984',
            minLon: '116.434753',
            maxLat: '37.199497',
            minLat: '37.197827',
        }
    },
    // 长信
    '27': {
        name: 'changxinhuaxue',
        coord:{
            maxLon: '117.4190318584442139',
            minLon: '117.4111944437026978',
            maxLat: '37.7988953165400474',
            minLat: '37.7912439130569382',
        }
    },
    // 水源糠醛
    '28': {
        name: 'shuiyuankangquan',
        coord:{
            maxLon: '115.8881601544',
            minLon: '115.8855117624',
            maxLat: '36.6010825231',
            minLat: '36.5983789575',
        }
    },
    // 东岳汶河
    '30': {
        name: 'dongyuewenhe',
        coord:{
            maxLon: '117.59661287',
            minLon: '117.59264052',
            maxLat: '36.35709934',
            minLat: '36.35390127',
        }
    },
    // 淄博林德 3#
    '31': {
        name: 'zibolinde',
        coord:{
            maxLon: '118.2691848278045654',
            minLon: '118.2670390605926514',
            maxLat: '36.7955096001262945',
            minLat: '36.7947062982130433',
        }
    },
    // 山东冠县天泉化工
    '35': {
        name: 'dongyuewenhe',
        coord:{
            maxLon: '115.66494562',
            minLon: '115.6620670193',
            maxLat: '36.50699251',
            minLat: '36.5047829854',
        }
    },
    // 山东洁宇化工有限公司
    '37': {
        name: 'sdjieyuhuagong',
        coord:{
            maxLon: '116.08924225',
            minLon: '116.08670488',
            maxLat: '36.8466152398',
            minLat: '36.84193751',
        }
    },
    // 阳谷祥泰塑料公司
    '38': {
        name: 'yangguxiangtai',
        coord:{
            maxLon: '115.76627344',
            minLon: '115.76467752',
            maxLat: '36.13261079',
            minLat: '36.13034373',
        }
    },

    // 联泓化学
    '40': {
        name: 'yangguxiangtai',
        coord:{
            maxLon: '117.2630131244659424',  
            minLon: '117.2448469136',   
            maxLat: '34.9785123746',   
            minLat: '34.9703621603',   
        }
    },

    // 莘县正升化工有限公司
    '41': {
        name: 'zhengshenghuagong',
        coord:{
            maxLon: '115.36172993',
            minLon: '115.35734385',
            maxLat: '35.83003329',
            minLat: '35.82647934',
        }
    },
    // 日照科巢生物
    '82': {
        name: 'kechaoshengwu',
        coord:{
            maxLon: '119.4094026088714600',
            minLon: '119.4058081945',
            maxLat: '35.3416603129293705',
            minLat: '35.3393430726',
        }
    },
    // 宏基亿泰
    '90': {
        name: 'hongjiyitai',
        coord:{
            maxLon: '109.12662327',
            minLon: '109.13383305',
            maxLat: '38.72812273',
            minLat: '38.72256077',
        }
    },
    // 高唐汇隆化工
    '102': {
        name: 'gaotanghuilong',
        coord:{
            maxLon: '116.3398869372',
            minLon: '116.3382586883',
            maxLat: '36.8466152398',
            minLat: '36.8481038064',
        }
    },
    // 莱阳市康德化工有限公司
    '137': {
        name: 'lyskangdeihuagong',
        coord:{
            maxLon: '120.6652772426605225',
            minLon: '120.6640541553497314',
            maxLat: '36.9516837469864754',
            minLat: '36.9507620502488194',
        }
    },
    // 国科天骥(山东)新材料有限责任公司
    '141': {
        name: 'guojitianji',
        coord:{
            maxLon: '117.9177832603454590',
            minLon: '117.9155570268630981',
            maxLat: '37.3393786008088142',
            minLat: '37.3379242159089557',
        }
    }
}





/*
1 聊城金鲁裕化工有限公司
2 莘县水源新能源科技有限公司
3 聊城德丰化工有限公司
4 莘县源源化工有限公司
5 林德气体
6 聊城东染化工有限公司
7 临沂国力化工有限公司
8 山东星瀚材料股份有限公司
9 潍坊港联化仓储有限公司
10 山东黄金地质矿产勘查有限公司
11 临沂瑞丰高分子材料有限公司
12 烟台泰和新材料股份有限公司
13 冠县新瑞实业有限公司
14 聊城隆盛化工有限公司
16 临沂启元气体有限公司
17 临沂海螺新材料科技有限公司
18 临沂市春明化工有限公司
19 山东沂联石化科技有限公司
20 山东同创精细化工有限公司
21 临沂广辰化工有限公司
22 山东洪志化工有限公司
23 沂水东信日用化工有限公司
24 山东邦能日化有限公司
25 平原倍斯特化工有限公司
26 山东中胜涂料有限公司
27 山东长信化学科技股份有限公司
28 聊城市水源糠醛有限公司
29 荣成市化工总厂有限公司
31 淄博齐鲁林德气体有限责任公司
32 东营市东海聚苯乙烯有限公司
33 莱州市日通油墨化工厂
34 烟台金富士水墨有限公司
35 山东冠县天泉化工有限公司
36 阳谷县四通亚铵厂
37 山东洁宇化工有限公司
38 山东阳谷祥泰塑料有限公司
40 联泓（山东）化学有限公司
41 莘县正升化工有限公司
43 临沂圣健工贸有限公司
44 山东省莱州市建国化工有限公司
45 齐河县德民气体有限公司
46 山东铎迈石化有限公司
47 山东昆达生物科技有限公司
48 临沂科裕化工有限公司
49 东营市博发化工有限公司
50 胜利油田新星燃气技术开发有限责任公司垦东轻烃回收站
51 山东泓达生物科技有限公司
52 山东鲁化森萱新材料有限公司
53 山东大明消毒科技有限公司
54 滕州市聚源化工有限公司
55 威海市石油有限公司
56 烟台万华华胜气体有限公司
58 联泓新材料科技股份有限公司
59 东营市方正有限责任公司
60 阳谷中天锌业有限公司
61 烟台冰轮环保科技有限公司
62 山东恒正新材料有限公司
63 山东博兴胜利科技有限公司
64 山东汉鸿新材料科技有限公司
65 山东海润新材料科技有限公司
66 荣成程浩气体有限公司
67 威海凯虹精密化工有限公司
68 荣成市泓远化工有限公司
69 荣成荣鑫气体股份有限公司
70 临沂朗诺化学有限公司
71 荣成市奥孚石油有限公司渔港加油站
72 荣成市呈祥气体股份有限公司
73 荣成市大海气体销售有限公司
74 荣成市明盛石油有限公司
75 荣成华东石油经销有限公司
76 荣成市全海石油销售有限公司
77 海成石油油库（原鑫宇石油）
78 山东院夼实业集团有限公司加油站
79 北京华夏诚智安全环境技术有限公司
80 聊城凯瑞化工有限公司
81 山东赛高新材料有限公司
82 山东科巢生物制药有限公司
83 山东桑莱斯新材料有限公司
84 山东誉中新材料股份有限公司
85 山东烁得化学科技股份有限公司
86 东营兴隆科技新材料有限公司
87 山东华大农业发展有限公司
88 东营市科嘉工贸有限公司
89 鄂尔多斯星星能源有限公司
90 鄂尔多斯宏基亿泰能源有限公司
91 内蒙古蒙兴鸿业投资有限公司
92 鄂尔多斯昊华国泰化工有限公司
93 内蒙古黄陶勒盖煤炭有限责任公司
94 内蒙古亿利化学工业有限公司
95 内蒙古苏里格天然气化工有限公司
96 内蒙古伊泰化工有限责任公司
97 鄂尔多斯市新杭能源有限公司
98 鄂尔多斯市亿鼎生态农业开发有限公司
99 河南金正大生态工程有限公司
100	华大控股（莱州）物流有限公司

101	莱州凯联化工有限公司
102	高唐汇隆化工有限公司
103	烟台新力生物科技有限公司
104	山东道恩降解材料有限公司
105	莱州市大通石油有限责任公司
106	试用系统
107	莱州市百辰绝缘材料有限公司
108	莱州莱玉化工
109	山东大易化工有限公司
110	山东泰茂化工科技有限公司
111	山东玉雪涂料科技有限公司
112	烟台融晟新材料有限公司
113	莱州市晨峰化工有限公司
114	莱州市鑫坤化工有限公司
115	莱州广盛化工建材有限公司
116	莱州市山水化工有限公司
117	彩虹高新材料（莱阳）有限公司
118	烟台舜康生物科技有限公司
119	莱州晶诚化工有限公司
120	万华聚氨酯合成材料有限公司
121	烟台市顺达聚氨酯有限责任公司
122	烟台达斯特克化工有限公司
123	赛飞特
124	莱州市守喜镁业有限公司
125	烟台保立佳化工科技有限公司
127	内蒙古海峡能源集团有限公司
128	乌审旗百方绿源油气有限公司
129	威海海润新材料科技有限公司
130	山东瑞丰高分子材料股份有限公司
131	烟台丰蓬液晶材料有限公司
132	烟台丰鲁精细化工有限责任公司
133	信泰永合（烟台）新材料有限公司
136	山东和天下新材料有限公司
137	莱阳市康德化工有限公司
139	烟台天利聚氨酯有限公司
141	国科天骥(山东)新材料有限责任公司
142	莱州市建材化工厂143	山东岚桥港有限公司
144	荣成青木高新材料有限公司
145	鄂尔多斯市荣鸿盛锐能源有限公司
146	内蒙古蒙联石油化工有限公司
147	内蒙古星汉氟都化工有限公司

149	东营华泰清河实业有限公司
150	青岛爱尔家佳新材料股份有限公司
151	临沂海螺新材料

*/
